## Import libraries

In [1]:
import pandas as pd 
import numpy as np

## 1. Selection based on label - loc 

In pandas slicing, start and end points are inclusive

In [12]:
df1 = pd.DataFrame(np.random.randn(5, 4),
                       columns=list('ABCD'),
                       index=pd.date_range('20130101', periods=5))

In [13]:
df1

                   A         B         C         D
2013-01-01 -0.744790 -0.055510 -0.656612 -0.189461
2013-01-02 -0.268862  1.480428  0.055898 -1.288838
2013-01-03 -0.500013 -0.516910 -2.660595 -0.045954
2013-01-04  0.713094 -0.496230 -0.374660 -0.236652
2013-01-05 -0.867189 -0.255580 -3.109858  2.112086

In [14]:
# Both returns the same result
df1.loc['20130101':'20130104', 'A':'C']
#df1.loc['2013-01-01':'2013-01-04']

                   A         B         C
2013-01-01 -0.744790 -0.055510 -0.656612
2013-01-02 -0.268862  1.480428  0.055898
2013-01-03 -0.500013 -0.516910 -2.660595
2013-01-04  0.713094 -0.496230 -0.374660

## 2. Selection based on position - iloc

In [15]:
df2 = pd.DataFrame(np.random.randn(6, 4),
                       index=list(range(0, 12, 2)),
                       columns=list(range(0, 8, 2)))

In [16]:
df2

           0         2         4         6
0   1.932974 -0.480065 -0.552596  2.296444
2   0.611311 -1.620457 -0.089830  0.891015
4   0.981704  0.923422 -0.610593 -0.135589
6  -0.745959 -1.576530 -0.452327 -0.395967
8   0.743999  1.894313  0.219219 -0.939042
10  0.655451  0.779697 -0.834103 -1.169549

In [18]:
df2.iloc[1:5, 2:4]

          4         6
2 -0.089830  0.891015
4 -0.610593 -0.135589
6 -0.452327 -0.395967
8  0.219219 -0.939042

## 3. Callable/conditional selection

In [19]:
df3 = pd.DataFrame(np.random.randn(6, 4),
                       index=list('abcdef'),
                       columns=list('ABCD'))

In [20]:
df3.loc[lambda df: df['A'] > 0, :]

          A         B         C         D
c  0.388468  0.899079  1.090582 -0.144979
d  1.211226  0.652778  0.865108  0.415399
e  0.702294 -1.191708  0.218741  0.868913
f  0.642059 -0.678299 -0.985179 -0.174701

## 4. Selection using isin()

In [46]:
df4 = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
                    'ids2': ['a', 'n', 'c', 'n']})

In [47]:
df4

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [49]:
values = ['a', 'b', 1, 3]

df4.isin(values)

    vals    ids   ids2
0   True   True   True
1  False   True  False
2   True  False  False
3  False  False  False

In [50]:
# Show the dataframe
df4[df4.isin(values)]

   vals  ids ids2
0   1.0    a    a
1   NaN    b  NaN
2   3.0  NaN  NaN
3   NaN  NaN  NaN

## 5.1 Selection using where() 

The key point is that where preserves the schema/dimension of the original table. The returned table is filled with NaN where the condition doesn't satisfy

In [62]:
df5 = df4.copy()

In [63]:
df5

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [64]:
df5.where(df5['vals'] > 2)

   vals  ids ids2
0   NaN  NaN  NaN
1   NaN  NaN  NaN
2   3.0    f    c
3   4.0    n    n

## 5.2 Masking data using mask()

Opposite of where

In [65]:
df5.mask(df5['vals'] > 2)

   vals  ids ids2
0   1.0    a    a
1   2.0    b    n
2   NaN  NaN  NaN
3   NaN  NaN  NaN

## 6. Sampling data

 - Normal sampling (with replacement)
 - Fractional sampling (without replacement)
 - Weighted sampling
 - Random sampling

In [52]:
df6 = pd.DataFrame({'num_legs': [2, 4, 8, 0],
                   'num_wings': [2, 0, 0, 0],
                   'num_specimen_seen': [10, 2, 1, 8]},
                  index=['falcon', 'dog', 'spider', 'fish'])

In [53]:
df6

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2
spider         8          0                  1
fish           0          0                  8

In [54]:
# Sample with replacement
df6['num_legs'].sample(n=3, replace=True)

falcon    2
spider    8
dog       4
Name: num_legs, dtype: int64

In [55]:
# Sampling on fractions, without replacement
df6.sample(frac=0.5, replace=False)

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
dog            4          0                  2

In [56]:
# Weighted sampling
df6.sample(n=2, weights='num_specimen_seen', random_state=1)

        num_legs  num_wings  num_specimen_seen
falcon         2          2                 10
fish           0          0                  8

A random_state = number, always samples data in the same fashion and returns same results

In [57]:
# Run 1
df6['num_legs'].sample(n=3, random_state=1)

fish      0
spider    8
falcon    2
Name: num_legs, dtype: int64

In [58]:
# Run 2
df6['num_legs'].sample(n=3, random_state=1)

fish      0
spider    8
falcon    2
Name: num_legs, dtype: int64

In [60]:
df6.where(df6['num_legs'] > 3)

        num_legs  num_wings  num_specimen_seen
falcon       NaN        NaN                NaN
dog          4.0        0.0                2.0
spider       8.0        0.0                1.0
fish         NaN        NaN                NaN

## 7. Enlarging dataframe based on conditions

 - np.where for up to 2 choices
 - np.select for more than 2 choices

In [66]:
df7 = pd.DataFrame({'col1': list('ABBC'), 'col2': list('ZZXY')})

df7

  col1 col2
0    A    Z
1    B    Z
2    B    X
3    C    Y

In [68]:
# Use numpy.where to expand the dataframe based on conditions
df7['color'] = np.where(df7['col2'] == 'Z', 'green', 'red')

df7

  col1 col2  color
0    A    Z  green
1    B    Z  green
2    B    X    red
3    C    Y    red

In [71]:
conditions = [
        (df7['col2'] == 'Z') & (df7['col1'] == 'A'),
        (df7['col2'] == 'Z') & (df7['col1'] == 'B'),
        (df7['col1'] == 'B')
    ]

choices = ['yellow', 'blue', 'purple']

df7['color'] = np.select(conditions, choices, default='black')

df7

  col1 col2   color
0    A    Z  yellow
1    B    Z    blue
2    B    X  purple
3    C    Y   black

## 8. Selection using query() method

Provides SQl like syntaxes.

Performs better than normal numpy expressions when there are more than approx. 200,000 rows

Query is used when you have different dataframes with same column names, and you want to execute the same query in all of them.

In [77]:
df7.query('col1 == "B"')

  col1 col2   color
1    B    Z    blue
2    B    X  purple

In [79]:
df7.query('index > 1')

  col1 col2   color
2    B    X  purple
3    C    Y   black